import {CarItem} from "./carInformationSlice";

export const TXL: CarItem = {
    mark: 'EXEED',
    model: 'TXL',
    title: 'Премиальный среднеразмерный внедорожник',
    equipment: '2.0 SPORT EDITION',
    year: 2023,
    power: '197',
    engineCapacity: "2.0",
    expenditure: "8.7",
    drive: 'AWD',
    bodywork: 'Внедорожник',
    transmission: 'Робот DCT7',
    color: 'Галактический серый',
    finishing: 'Premium',
    vin: 'LVTDD24B*PD****25',
    price: 3690000,
    description: [
        'Интеллектуальная система управления',
        'Длинная колесная база - 2800 мм',
        'Высокая устойчивость на дороге',
        'Комфортный салон'
    ],
    carts: [
        {
            title:'Комфорт в каждой детали',
            text: 'Водительское кресло с 10-ю электрическими регулировками, ' +
                'памятью настроек и усиленной боковой поддержкой предоставляет ' +
                'максимум комфорта людям любого роста и комплекции. ' +
                'А в холодную погоду ваш комфорт поддержит полная подготовка автомобиля к зиме.'
        },
        {
            title:'Комфорт в каждой детали',
            text: 'Водительское кресло с 10-ю электрическими регулировками, ' +
                'памятью настроек и усиленной боковой поддержкой предоставляет ' +
                'максимум комфорта людям любого роста и комплекции. ' +
                'А в холодную погоду ваш комфорт поддержит полная подготовка автомобиля к зиме.'
        },
        {
            title:'Комфорт в каждой детали',
            text: 'Водительское кресло с 10-ю электрическими регулировками, ' +
                'памятью настроек и усиленной боковой поддержкой предоставляет ' +
                'максимум комфорта людям любого роста и комплекции. ' +
                'А в холодную погоду ваш комфорт поддержит полная подготовка автомобиля к зиме.'
        },
        {
            title:'Комфорт в каждой детали',
            text: 'Водительское кресло с 10-ю электрическими регулировками, ' +
                'памятью настроек и усиленной боковой поддержкой предоставляет ' +
                'максимум комфорта людям любого роста и комплекции. ' +
                'А в холодную погоду ваш комфорт поддержит полная подготовка автомобиля к зиме.'
        }
    ],
    image: 'TXL.png',
    image1: 'TXL.png',
    image2: 'TXL2.png'

}

export const VX: CarItem = {
    mark: 'EXEED',
    model: 'VX',
    title: 'Флагманский премиальный внедорожник',
    equipment: 'President 7 мест',
    year: 2023,
    power: "249",
    engineCapacity: "2.0",
    expenditure: "8.2",
    drive: 'AWD',
    bodywork: 'Внедорожник',
    transmission: 'Автомат 8AT',
    color: 'Эклипс (серебро)',
    finishing: 'Nappa',
    vin: 'LVTDD24B*PD****25',
    price: 6700000,
    description: [
        'Флагманский полноразмерный внедорожник',
        'Онлайн-сервисы',
        'Возможность дистанционного управления',
        '6-ти или 7-ми местный салон'
    ],
    carts: [
        {
            title:'Воплощение статуса',
            text: 'Дизайн кузова и головного освещения подчеркивает ' +
                'элегантность и при этом мощь полноразмерного внедорожника. ' +
                'А поистине премиальная отделка салона поражает своим ' +
                'великолепием и качеством материалов.'
        },
        {
            title:'Безусловный комфорт',
            text: 'Совершенно новый премиальный дизайн интерьера. ' +
                'Качественные натуральные материалы – Nappa и шпон дерева. ' +
                'Сиденье повышенной комфортности для пассажира первого ряда ' +
                'с пятью режимами массажа и поддержкой для ног, а также ' +
                'вентиляция и обогрев сидений второго ряда.'
        },
        {
            title:'Безопасность',
            text: 'В новом VX вы ощутите полную защищенность. ' +
                'Усиленный каркас кузова с двухсторонней оцинковкой, ' +
                '30 систем помощи водителю ADAS, 10 подушек безопасности ' +
                'и мощная тормозная система. Автомобиль получил наивысшую ' +
                'оценку безопасности по результатам испытаний C-NCAP.'
        },
        {
            title:'Технологии',
            text: 'Впервые в линейке EXEED автомобиль оснащён онлайн сервисами. ' +
                'Удалённое управление автомобилем через приложение создаёт ' +
                'новый уровень пользования автомобилем. А центральным элементом ' +
                'в салоне является широкий дисплей с 3-мя экранами, объединенными ' +
                'единым триплексным стеклом.'
        }
    ],
    image: 'VX.png',
    image1: 'VX1.png',
    image2: 'VX2.png'

}
export const LX: CarItem = {
    mark: 'EXEED',
    model: 'LX',
    title: 'Флагманский премиальный внедорожник',
    equipment: 'President 7 мест',
    year: 2023,
    power: "249",
    engineCapacity: "2.0",
    expenditure: "8.2",
    drive: 'AWD',
    bodywork: 'Внедорожник',
    transmission: 'Автомат 8AT',
    color: 'Эклипс (серебро)',
    finishing: 'Nappa',
    vin: 'LVTDD24B*PD****25',
    price: 3250000,
    description: [
        'Передний и полный привод',
        'Подогрев руля и сидений',
        'Дистанционный запуск двигателя',
        'Цифровой кокпит с дисплеями'
    ],
    carts: [
        {
            title:'Воплощение статуса',
            text: 'Дизайн кузова и головного освещения подчеркивает ' +
                'элегантность и при этом мощь полноразмерного внедорожника. ' +
                'А поистине премиальная отделка салона поражает своим ' +
                'великолепием и качеством материалов.'
        },
        {
            title:'Безусловный комфорт',
            text: 'Совершенно новый премиальный дизайн интерьера. ' +
                'Качественные натуральные материалы – Nappa и шпон дерева. ' +
                'Сиденье повышенной комфортности для пассажира первого ряда ' +
                'с пятью режимами массажа и поддержкой для ног, а также ' +
                'вентиляция и обогрев сидений второго ряда.'
        },
        {
            title:'Безопасность',
            text: 'В новом VX вы ощутите полную защищенность. ' +
                'Усиленный каркас кузова с двухсторонней оцинковкой, ' +
                '30 систем помощи водителю ADAS, 10 подушек безопасности ' +
                'и мощная тормозная система. Автомобиль получил наивысшую ' +
                'оценку безопасности по результатам испытаний C-NCAP.'
        },
        {
            title:'Технологии',
            text: 'Впервые в линейке EXEED автомобиль оснащён онлайн сервисами. ' +
                'Удалённое управление автомобилем через приложение создаёт ' +
                'новый уровень пользования автомобилем. А центральным элементом ' +
                'в салоне является широкий дисплей с 3-мя экранами, объединенными ' +
                'единым триплексным стеклом.'
        }
    ],
    image: 'LX.png',
    image1: 'LX.png',
    image2: 'LX2.png'

}
export const RX: CarItem = {
    mark: 'EXEED',
    model: 'RX',
    title: 'Флагманский премиальный внедорожник',
    equipment: 'President 7 мест',
    year: 2023,
    power: "249",
    engineCapacity: "2.0",
    expenditure: "8.2",
    drive: 'AWD',
    bodywork: 'Внедорожник',
    transmission: 'Автомат 8AT',
    color: 'Эклипс (серебро)',
    finishing: 'Nappa',
    vin: 'LVTDD24B*PD****25',
    price: 4490000,
    description: [
        'Эмоциональный дизайнерский почерк',
        'Технологический экстерьер',
        'Дистанционный запуск двигателя',
        'Футуристичный салон'
    ],
    carts: [
        {
            title:'Воплощение статуса',
            text: 'Дизайн кузова и головного освещения подчеркивает ' +
                'элегантность и при этом мощь полноразмерного внедорожника. ' +
                'А поистине премиальная отделка салона поражает своим ' +
                'великолепием и качеством материалов.'
        },
        {
            title:'Безусловный комфорт',
            text: 'Совершенно новый премиальный дизайн интерьера. ' +
                'Качественные натуральные материалы – Nappa и шпон дерева. ' +
                'Сиденье повышенной комфортности для пассажира первого ряда ' +
                'с пятью режимами массажа и поддержкой для ног, а также ' +
                'вентиляция и обогрев сидений второго ряда.'
        },
        {
            title:'Безопасность',
            text: 'В новом VX вы ощутите полную защищенность. ' +
                'Усиленный каркас кузова с двухсторонней оцинковкой, ' +
                '30 систем помощи водителю ADAS, 10 подушек безопасности ' +
                'и мощная тормозная система. Автомобиль получил наивысшую ' +
                'оценку безопасности по результатам испытаний C-NCAP.'
        },
        {
            title:'Технологии',
            text: 'Впервые в линейке EXEED автомобиль оснащён онлайн сервисами. ' +
                'Удалённое управление автомобилем через приложение создаёт ' +
                'новый уровень пользования автомобилем. А центральным элементом ' +
                'в салоне является широкий дисплей с 3-мя экранами, объединенными ' +
                'единым триплексным стеклом.'
        }
    ],
    image: 'RX.png',
    image1: 'RX.png',
    image2: 'RX2.png'

}